l = ['1', '新型肺炎实时动态', '1682630', '2', '希拉里吐槽特朗普', '942252', '3', '钟南山建议保持防控措施', '721675', '4', '央视评回国女子大闹机场', '611025', '5', '重庆全面恢复火锅等餐饮堂食', '531300', '6', '意大利又一护士因感染自杀', '326988', '7', '纽约1天近3000名警察请病假', '305734', '8', '2万多名北京师生滞留湖北', '303375', '9', '北京发热患者全部核酸检测', '228500', '10', '马德里冰宫改成停尸房', '202363', '11', '麻生太郎吐槽欧洲', '195000', '12', '塞尔维亚奶奶阳台遛狗', '177238', '13', '查尔斯王子核酸检测呈阳性', '149463', '14', '北大专家建议发放1000元消费券', '142187', '15', '全球新冠肺炎确诊病例超46万', '141882', '16', '滞留湖北需要进京人员近20万', '134100', '17', '武磊方辟谣核酸检测呈阴性', '97288', '18', '北京发布供热升温令', '97213', '19', '首批援意医疗专家组启程回国', '95138', '20', '特朗普向韩国寻求医疗设备支援', '94113']


l = [i for i in l if len(i)>2][2:]
l2 = []
for i in range(0,len(l),2):
    temp = l[i]+l[i-1]
    l2.append(temp)
print(l2)

